# LoadAreaIsProjected Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LoadAreaIsProjected Property
ParameterTypeId Class See Also
---
"Projected Load"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LoadAreaIsProjected { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LoadAreaIsProjected As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LoadAreaIsProjected {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace